dokumentacja/edm/P1-DS-Dokumentacja_integracyjna_P1_EDM_20220915_W16/Załącznik nr 3 - Przykłady - wersja 1.16/rejestrujRepozytorium/Przykład rejestrowania repozytorium.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://csioz.gov.pl/p1/szar/ws/v1" xmlns:v11="http://csioz.gov.pl/p1/szar/mt/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:RejestrowanieRepozytoriumRequest>
         <!--Optional:-->
         <v11:wymusUtworzenieNowegoRepozytorium>true</v11:wymusUtworzenieNowegoRepozytorium>
      </v1:RejestrowanieRepozytoriumRequest>
   </soapenv:Body>
</soapenv:Envelope>